data/hpmysql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2018-04-05 Thu 00:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>High Performance MySQL</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="database, mysql, performance" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">High Performance MySQL</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org67b953c">1. Special SQL</a>
<ul>
<li><a href="#org8a3aef6">1.1. AUTOCOMMIT</a></li>
<li><a href="#org4c86dd0">1.2. Set isolation level</a></li>
</ul>
</li>
<li><a href="#org0f42596">2. Storage Engine</a>
<ul>
<li><a href="#org7372c29">2.1. Change engine</a></li>
</ul>
</li>
<li><a href="#org2bc8bf6">3. Benchmark</a>
<ul>
<li><a href="#org02103da">3.1. What to Measure</a></li>
<li><a href="#org7cbcfd7">3.2. Gathering Data on MySQL</a></li>
<li><a href="#org5fc8db4">3.3. Analyzing Results</a></li>
<li><a href="#org0cf6ed0">3.4. Tools</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org67b953c" class="outline-2">
<h2 id="org67b953c"><span class="section-number-2">1</span> Special SQL</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8a3aef6" class="outline-3">
<h3 id="org8a3aef6"><span class="section-number-3">1.1</span> AUTOCOMMIT</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sql">SHOW VARIABLES <span style="color: #3a81c3; font-weight: bold;">LIKE</span> <span style="color: #2d9574;">'AUTOCOMMIT'</span>;
<span style="color: #3a81c3; font-weight: bold;">SET</span> AUTOCOMMIT = <span style="color: #4e3163;">1</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c86dd0" class="outline-3">
<h3 id="org4c86dd0"><span class="section-number-3">1.2</span> Set isolation level</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">SET</span> <span style="color: #3a81c3; font-weight: bold;">SESSION</span> <span style="color: #3a81c3; font-weight: bold;">TRANSACTION</span> <span style="color: #3a81c3; font-weight: bold;">ISOLATION</span> <span style="color: #3a81c3; font-weight: bold;">LEVEL</span> <span style="color: #3a81c3; font-weight: bold;">READ</span> <span style="color: #3a81c3; font-weight: bold;">COMMITTED</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0f42596" class="outline-2">
<h2 id="org0f42596"><span class="section-number-2">2</span> Storage Engine</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>InnoDB</li>
<li>MyISAM</li>
<li>Archive</li>
<li>OLTP: XtraDB, TokuDB, like InnoDB</li>
<li>Infobright: Column-oriented</li>
<li>Aria: successor to MyISAM, crash-safe</li>
<li>MySQL Cluster</li>
</ul>
</div>

<div id="outline-container-org7372c29" class="outline-3">
<h3 id="org7372c29"><span class="section-number-3">2.1</span> Change engine</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org9dc595a" class="outline-4">
<h4 id="org9dc595a"><span class="section-number-4">2.1.1</span> ALTER TABLE</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">ALTER</span>&#160;<span style="color: #3a81c3; font-weight: bold;">TABLE</span>&#160;mytable&#160;ENGINE&#160;=&#160;InnoDB;
</pre>
</div>
<ul class="org-ul">
<li>row-by-row copy</li>
<li>inplace and slow</li>
</ul>
</div>
</div>
<div id="outline-container-org617d299" class="outline-4">
<h4 id="org617d299"><span class="section-number-4">2.1.2</span> Dump and import</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Use <b>mysqldump</b>
</p>
<ol class="org-ol">
<li>dump to text</li>
<li>change create sql</li>
<li>import</li>
</ol>
</div>
</div>
<div id="outline-container-org5dba4f5" class="outline-4">
<h4 id="org5dba4f5"><span class="section-number-4">2.1.3</span> CREATE and SELECT</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">CREATE</span>&#160;<span style="color: #3a81c3; font-weight: bold;">TABLE</span>&#160;innodb_table&#160;<span style="color: #3a81c3; font-weight: bold;">LIKE</span>&#160;myisam_table;
<span style="color: #3a81c3; font-weight: bold;">ALTER</span>&#160;<span style="color: #3a81c3; font-weight: bold;">TABLE</span>&#160;innodb_table&#160;ENGINE=InnoDB;
<span style="color: #3a81c3; font-weight: bold;">INSERT</span>&#160;<span style="color: #3a81c3; font-weight: bold;">INTO</span>&#160;innodb_table&#160;<span style="color: #3a81c3; font-weight: bold;">SELECT</span>&#160;*&#160;<span style="color: #3a81c3; font-weight: bold;">FROM</span>&#160;myisam_table;
</pre>
</div>
<p>
For large volume data:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #3a81c3; font-weight: bold;">START</span>&#160;<span style="color: #3a81c3; font-weight: bold;">TRANSACTION</span>;
<span style="color: #3a81c3; font-weight: bold;">INSERT</span>&#160;<span style="color: #3a81c3; font-weight: bold;">INTO</span>&#160;innodb_table&#160;<span style="color: #3a81c3; font-weight: bold;">SELECT</span>&#160;*&#160;<span style="color: #3a81c3; font-weight: bold;">FROM</span>&#160;myisam_table <span style="color: #3a81c3; font-weight: bold;">WHERE</span>&#160;id&#160;<span style="color: #3a81c3; font-weight: bold;">BETWEEN</span>&#160;x&#160;<span style="color: #3a81c3; font-weight: bold;">AND</span>&#160;y;
<span style="color: #3a81c3; font-weight: bold;">COMMIT</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf64dc4" class="outline-4">
<h4 id="orgdf64dc4"><span class="section-number-4">2.1.4</span> Online schema change</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
<i>pt-online-schema-change</i> (based on Facebook’s online schema change technique)
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org2bc8bf6" class="outline-2">
<h2 id="org2bc8bf6"><span class="section-number-2">3</span> Benchmark</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org02103da" class="outline-3">
<h3 id="org02103da"><span class="section-number-3">3.1</span> What to Measure</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org0059b67" class="outline-4">
<h4 id="org0059b67"><span class="section-number-4">3.1.1</span> Throughput</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Throughput is defined as the number of transactions per unit of time. The usual unit of measurement is
transactions per second(TPS), although it is sometimes transactions per minute(TPM).
</p>
</div>
</div>

<div id="outline-container-org3fb694f" class="outline-4">
<h4 id="org3fb694f"><span class="section-number-4">3.1.2</span> Response time or latency</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
This measures the total time a task requires.
</p>
</div>
</div>

<div id="outline-container-org11088ab" class="outline-4">
<h4 id="org11088ab"><span class="section-number-4">3.1.3</span> Concurrency</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Concurrency is an important but frequently misused and misunderstood metric. Concurrency benchmark shoud be
the number of threads or connections doing work simultaneously.
</p>
</div>
</div>

<div id="outline-container-org5ac3995" class="outline-4">
<h4 id="org5ac3995"><span class="section-number-4">3.1.4</span> Scalability</h4>
</div>
</div>

<div id="outline-container-org7cbcfd7" class="outline-3">
<h3 id="org7cbcfd7"><span class="section-number-3">3.2</span> Gathering Data on MySQL</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>specify user to execute <b>mysql</b> command
<code>mysql_config_editor set  --user=username  --host=127.0.0.1 --port=3306 --password</code></li>

<li>a sample shell script that you can use to gather data on MySQL during benchmarks</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">sh</span>
<span style="color: #715ab1;">INTERVAL</span>=<span style="color: #4e3163;">5</span>
<span style="color: #715ab1;">PREFIX</span>=$<span style="color: #715ab1;">INTERVAL</span>-sec-status
<span style="color: #715ab1;">RUNFILE</span>=/home/benchmark/running
mysql -e <span style="color: #2d9574;">'SHOW GLOBAL VARIABLES'</span> &gt;&gt; mysql-variables
<span style="color: #3a81c3; font-weight: bold;">while</span> test -e $<span style="color: #715ab1;">RUNFILE</span>; <span style="color: #3a81c3; font-weight: bold;">do</span>
    <span style="color: #715ab1;">file</span>=$<span style="color: #3a81c3;">(</span>date +%F_%I<span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">sleep</span>=$<span style="color: #3a81c3;">(</span>date +%s.%N | awk <span style="color: #2d9574;">"{print $INTERVAL - (\$1 % $INTERVAL)}"</span><span style="color: #3a81c3;">)</span>
    sleep $<span style="color: #715ab1;">sleep</span>
    <span style="color: #715ab1;">ts</span>=<span style="color: #2d9574;">"$(date +"TS %s.%N %F %T")"</span>
    <span style="color: #715ab1;">loadavg</span>=<span style="color: #2d9574;">"$(uptime)"</span>
    <span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"$ts $loadavg"</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-$<span style="color: #3a81c3;">{</span><span style="color: #715ab1;">file</span><span style="color: #3a81c3;">}</span>-status
    mysql -e <span style="color: #2d9574;">'SHOW GLOBAL STATUS'</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-$<span style="color: #3a81c3;">{</span><span style="color: #715ab1;">file</span><span style="color: #3a81c3;">}</span>-status &amp;
    <span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"$ts $loadavg"</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-$<span style="color: #3a81c3;">{</span><span style="color: #715ab1;">file</span><span style="color: #3a81c3;">}</span>-innodbstatus
    mysql -e <span style="color: #2d9574;">'SHOW ENGINE INNODB STATUS\G'</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-$<span style="color: #3a81c3;">{</span><span style="color: #715ab1;">file</span><span style="color: #3a81c3;">}</span>-innodbstatus &amp;
    <span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"$ts $loadavg"</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-$<span style="color: #3a81c3;">{</span><span style="color: #715ab1;">file</span><span style="color: #3a81c3;">}</span>-processlist
    mysql -e <span style="color: #2d9574;">'SHOW FULL PROCESSLIST\G'</span> &gt;&gt; $<span style="color: #715ab1;">PREFIX</span>-$<span style="color: #3a81c3;">{</span><span style="color: #715ab1;">file</span><span style="color: #3a81c3;">}</span>-processlist &amp;
    <span style="color: #3a81c3;">echo</span> $<span style="color: #715ab1;">ts</span>
<span style="color: #3a81c3; font-weight: bold;">done</span>
<span style="color: #3a81c3;">echo</span> Exiting because $<span style="color: #715ab1;">RUNFILE</span> does not exist.

</pre>
</div>
</div>
</div>

<div id="outline-container-org5fc8db4" class="outline-3">
<h3 id="org5fc8db4"><span class="section-number-3">3.3</span> Analyzing Results</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/sh</span>
awk '
<span style="color: #3a81c3; font-weight: bold;">BEGIN</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #6c3163;">printf</span> <span style="color: #2d9574;">"#ts date time load QPS"</span>;
  fmt = <span style="color: #2d9574;">" %.2f"</span>;
<span style="color: #3a81c3;">}</span>
<span style="color: #2d9574;">/^TS/</span> <span style="color: #3a81c3;">{</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The timestamp lines begin with TS.</span>
  ts = <span style="color: #6c3163;">substr</span><span style="color: #6c3163;">(</span>$2, <span style="color: #4e3163;">1</span>, <span style="color: #6c3163;">index</span><span style="color: #2d9574;">(</span>$2, <span style="color: #2d9574;">"."</span><span style="color: #2d9574;">)</span> - <span style="color: #4e3163;">1</span><span style="color: #6c3163;">)</span>;
  load = <span style="color: #715ab1;">NF</span> - <span style="color: #4e3163;">2</span>;
  diff = ts - prev_ts;
  prev_ts = ts;
  <span style="color: #6c3163;">printf</span> <span style="color: #2d9574;">"\n%s %s %s %s"</span>, ts, $3, $4, <span style="color: #6c3163;">substr</span><span style="color: #6c3163;">(</span>$load, <span style="color: #4e3163;">1</span>, <span style="color: #6c3163;">length</span><span style="color: #2d9574;">(</span>$load<span style="color: #2d9574;">)</span>-<span style="color: #4e3163;">1</span><span style="color: #6c3163;">)</span>;
<span style="color: #3a81c3;">}</span>
<span style="color: #2d9574;">/Queries/</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #6c3163;">printf</span> fmt, <span style="color: #6c3163;">(</span>$2-Queries<span style="color: #6c3163;">)</span>/diff;
  Queries=$2
<span style="color: #3a81c3;">}</span>
' <span style="color: #2d9574;">"$@"</span>
</pre>
</div>
</div>
<div id="outline-container-orgb75425e" class="outline-4">
<h4 id="orgb75425e"><span class="section-number-4">3.3.1</span> plot</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-sh">gnuplot&gt; plot <span style="color: #2d9574;">"filename"</span> using <span style="color: #4e3163;">5</span> w lines title <span style="color: #2d9574;">"QPS"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0cf6ed0" class="outline-3">
<h3 id="org0cf6ed0"><span class="section-number-3">3.4</span> Tools</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orge645825" class="outline-4">
<h4 id="orge645825"><span class="section-number-4">3.4.1</span> http_load</h4>
</div>
<div id="outline-container-org087b88e" class="outline-4">
<h4 id="org087b88e"><span class="section-number-4">3.4.2</span> MySQL Benchmark Suite</h4>
</div>
<div id="outline-container-orge4ac05a" class="outline-4">
<h4 id="orge4ac05a"><span class="section-number-4">3.4.3</span> <b>sysbench</b></h4>
</div>
<div id="outline-container-org9de6271" class="outline-4">
<h4 id="org9de6271"><span class="section-number-4">3.4.4</span> dbt2</h4>
</div>
<div id="outline-container-org1dddc47" class="outline-4">
<h4 id="org1dddc47"><span class="section-number-4">3.4.5</span> TPPC-MySQL</h4>
</div>
</div>
</div>
</div>
</body>
</html>